/* automatically generated by rust-bindgen 0.69.1 */

pub const GLFW_VERSION_MAJOR: i32 = 3;
pub const GLFW_VERSION_MINOR: i32 = 4;
pub const GLFW_VERSION_REVISION: i32 = 0;
pub const GLFW_TRUE: i32 = 1;
pub const GLFW_FALSE: i32 = 0;
pub const GLFW_RELEASE: i32 = 0;
pub const GLFW_PRESS: i32 = 1;
pub const GLFW_REPEAT: i32 = 2;
pub const GLFW_HAT_CENTERED: i32 = 0;
pub const GLFW_HAT_UP: i32 = 1;
pub const GLFW_HAT_RIGHT: i32 = 2;
pub const GLFW_HAT_DOWN: i32 = 4;
pub const GLFW_HAT_LEFT: i32 = 8;
pub const GLFW_HAT_RIGHT_UP: i32 = 3;
pub const GLFW_HAT_RIGHT_DOWN: i32 = 6;
pub const GLFW_HAT_LEFT_UP: i32 = 9;
pub const GLFW_HAT_LEFT_DOWN: i32 = 12;
pub const GLFW_KEY_UNKNOWN: i32 = -1;
pub const GLFW_KEY_SPACE: i32 = 32;
pub const GLFW_KEY_APOSTROPHE: i32 = 39;
pub const GLFW_KEY_COMMA: i32 = 44;
pub const GLFW_KEY_MINUS: i32 = 45;
pub const GLFW_KEY_PERIOD: i32 = 46;
pub const GLFW_KEY_SLASH: i32 = 47;
pub const GLFW_KEY_0: i32 = 48;
pub const GLFW_KEY_1: i32 = 49;
pub const GLFW_KEY_2: i32 = 50;
pub const GLFW_KEY_3: i32 = 51;
pub const GLFW_KEY_4: i32 = 52;
pub const GLFW_KEY_5: i32 = 53;
pub const GLFW_KEY_6: i32 = 54;
pub const GLFW_KEY_7: i32 = 55;
pub const GLFW_KEY_8: i32 = 56;
pub const GLFW_KEY_9: i32 = 57;
pub const GLFW_KEY_SEMICOLON: i32 = 59;
pub const GLFW_KEY_EQUAL: i32 = 61;
pub const GLFW_KEY_A: i32 = 65;
pub const GLFW_KEY_B: i32 = 66;
pub const GLFW_KEY_C: i32 = 67;
pub const GLFW_KEY_D: i32 = 68;
pub const GLFW_KEY_E: i32 = 69;

#[doc = "The function pointer type for joystick hat movement callbacks.\n\n This is the function pointer type for joystick hat movement callbacks. A joystick\n hat movement callback function has the following signature:\n void function_name(int jid, int hat, int position)\n # Arguments\n\n* `jid` (direction in) - The joystick that had an axis moved.\n * `hat` (direction in) - The [joystick hat]([`joystick`] hats) that was moved.\n * `position` (direction in) - A value that indicates the position of the hat.\n The position parameter is one of the following values:\n\n Name | Value\n ---- | -----\n `GLFW_HAT_CENTERED` | 0\n `GLFW_HAT_UP` | 1\n `GLFW_HAT_RIGHT` | 2\n `GLFW_HAT_DOWN` | 4\n `GLFW_HAT_LEFT` | 8\n `GLFW_HAT_RIGHT_UP` | `GLFW_HAT_RIGHT` `GLFW_HAT_UP`\n `GLFW_HAT_RIGHT_DOWN` | `GLFW_HAT_RIGHT` `GLFW_HAT_DOWN`\n `GLFW_HAT_LEFT_UP` | `GLFW_HAT_LEFT` `GLFW_HAT_UP`\n `GLFW_HAT_LEFT_DOWN` | `GLFW_HAT_LEFT` `GLFW_HAT_DOWN`\n\n The diagonal directions are bitwise combinations of the primary (up, right,\n down and left) directions and you can test for these individually by ANDing\n it with the corresponding direction.\n\n [`input_joystick_hat`]\n [`glfwSetJoystickHatCallback`]\n\n > Available since: Added in version 3.4.\n input"]
pub type GLFWjoystickhatfun = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
    ),
>;
#[doc = "The function pointer type for game pad state changes.\n\n This is the function pointer type for game pad state change callbacks.\n A game pad state change callback function has the following signature:\n void function_name(int jid, GLFWgamepadstate* state)\n # Arguments\n\n* `jid` (direction in) - The ID of the game pad that changed state.\n * `buttons` (direction in) - The states of each\n [gamepad button]([`gamepad_buttons),`]\n `GLFW_PRESS` or `GLFW_RELEASE`.\n * `axes` (direction in) - The states of each [gamepad axis]([`gamepad_axes),`]\n in the range -1.0 to 1.0 inclusive.\n\n [`input_gamepad`]\n [`glfwSetGamepadStateCallback`]\n\n > Available since: Added in version 3.4.\n input"]
pub type GLFWgamepadstatefun = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: ::std::os::raw::c_int,
        buttons: *mut ::std::os::raw::c_uchar,
        axes: *mut f32,
    ),
>;
#[doc = "Video mode type.\n\n This describes a single video mode.\n\n [`monitor_modes`]\n [`glfwGetVideoMode`]\n [`glfwGetVideoModes`]\n\n > Available since: Added in version 1.0.\n Added refresh rate member.\n\n monitor"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GLFWvidmode {
    #[doc = "The width, in screen coordinates, of the video mode."]
    pub width: ::std::os::raw::c_int,
    #[doc = "The height, in screen coordinates, of the video mode."]
    pub height: ::std::os::raw::c_int,
    #[doc = "The bit depth of the red channel of the video mode."]
    pub redBits: ::std::os::raw::c_int,
    #[doc = "The bit depth of the green channel of the video mode."]
    pub greenBits: ::std::os::raw::c_int,
    #[doc = "The bit depth of the blue channel of the video mode."]
    pub blueBits: ::std::os::raw::c_int,
    #[doc = "The refresh rate, in Hz, of the video mode."]
    pub refreshRate: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_GLFWvidmode() {
    const UNINIT: ::std::mem::MaybeUninit<GLFWvidmode> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<GLFWvidmode>(),
        24usize,
        concat!("Size of: ", stringify!(GLFWvidmode))
    );
    assert_eq!(
        ::std::mem::align_of::<GLFWvidmode>(),
        4usize,
        concat!("Alignment of ", stringify!(GLFWvidmode))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GLFWvidmode),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(GLFWvidmode),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).redBits) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GLFWvidmode),
            "::",
            stringify!(redBits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).greenBits) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(GLFWvidmode),
            "::",
            stringify!(greenBits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).blueBits) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GLFWvidmode),
            "::",
            stringify!(blueBits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).refreshRate) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(GLFWvidmode),
            "::",
            stringify!(refreshRate)
        )
    );
}
#[doc = "Gamma ramp.\n\n This describes the gamma ramp for a monitor.\n\n [`monitor_gamma`]\n [`glfwGetGammaRamp`]\n [`glfwSetGammaRamp`]\n\n > Available since: Added in version 3.0.\n\n monitor"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GLFWgammaramp {
    #[doc = "An array of value describing the response of the red channel."]
    pub red: *mut ::std::os::raw::c_ushort,
    #[doc = "An array of value describing the response of the green channel."]
    pub green: *mut ::std::os::raw::c_ushort,
    #[doc = "An array of value describing the response of the blue channel."]
    pub blue: *mut ::std::os::raw::c_ushort,
    #[doc = "The number of elements in each array."]
    pub size: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_GLFWgammaramp() {
    const UNINIT: ::std::mem::MaybeUninit<GLFWgammaramp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<GLFWgammaramp>(),
        32usize,
        concat!("Size of: ", stringify!(GLFWgammaramp))
    );
    assert_eq!(
        ::std::mem::align_of::<GLFWgammaramp>(),
        8usize,
        concat!("Alignment of ", stringify!(GLFWgammaramp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).red) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GLFWgammaramp),
            "::",
            stringify!(red)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).green) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GLFWgammaramp),
            "::",
            stringify!(green)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).blue) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GLFWgammaramp),
            "::",
            stringify!(blue)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GLFWgammaramp),
            "::",
            stringify!(size)
        )
    );
}
#[doc = "Image data.\n\n This describes a single 2D image. See the documentation for each related\n function what the expected pixel format is.\n\n [`cursor_custom`]\n [`window_icon`]\n\n > Available since: Added in version 2.1.\n Removed format and bytes-per-pixel members.\n\n window"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GLFWimage {
    #[doc = "The width, in pixels, of this image."]
    pub width: ::std::os::raw::c_int,
    #[doc = "The height, in pixels, of this image."]
    pub height: ::std::os::raw::c_int,
    #[doc = "The pixel data of this image, arranged left-to-right, top-to-bottom."]
    pub pixels: *mut ::std::os::raw::c_uchar,
}
#[test]
fn bindgen_test_layout_GLFWimage() {
    const UNINIT: ::std::mem::MaybeUninit<GLFWimage> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<GLFWimage>(),
        16usize,
        concat!("Size of: ", stringify!(GLFWimage))
    );
    assert_eq!(
        ::std::mem::align_of::<GLFWimage>(),
        8usize,
        concat!("Alignment of ", stringify!(GLFWimage))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GLFWimage),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(GLFWimage),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pixels) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GLFWimage),
            "::",
            stringify!(pixels)
        )
    );
}
#[doc = "Gamepad input state\n\n This describes the input state of a gamepad.\n\n [`gamepad`]\n [`glfwGetGamepadState`]\n [`glfwSetGamepadStateCallback`]\n\n > Available since: Added in version 3.3.\n\n input"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GLFWgamepadstate {
    #[doc = "The states of each [gamepad button]([`gamepad_buttons),`] `GLFW_PRESS`\n or `GLFW_RELEASE`."]
    pub buttons: [::std::os::raw::c_uchar; 15usize],
    #[doc = "The states of each [gamepad axis]([`gamepad_axes),`] in the range -1.0\n to 1.0 inclusive."]
    pub axes: [f32; 6usize],
}
#[test]
fn bindgen_test_layout_GLFWgamepadstate() {
    const UNINIT: ::std::mem::MaybeUninit<GLFWgamepadstate> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<GLFWgamepadstate>(),
        40usize,
        concat!("Size of: ", stringify!(GLFWgamepadstate))
    );
    assert_eq!(
        ::std::mem::align_of::<GLFWgamepadstate>(),
        4usize,
        concat!("Alignment of ", stringify!(GLFWgamepadstate))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buttons) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GLFWgamepadstate),
            "::",
            stringify!(buttons)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).axes) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GLFWgamepadstate),
            "::",
            stringify!(axes)
        )
    );
}
#[doc = "[`init_allocator`]\n [`glfwInitAllocator`]\n\n > Available since: Added in version 3.4.\n\n init"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GLFWallocator {
    pub allocate: GLFWallocatefun,
    pub reallocate: GLFWreallocatefun,
    pub deallocate: GLFWdeallocatefun,
    pub user: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_GLFWallocator() {
    const UNINIT: ::std::mem::MaybeUninit<GLFWallocator> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<GLFWallocator>(),
        32usize,
        concat!("Size of: ", stringify!(GLFWallocator))
    );
    assert_eq!(
        ::std::mem::align_of::<GLFWallocator>(),
        8usize,
        concat!("Alignment of ", stringify!(GLFWallocator))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).allocate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GLFWallocator),
            "::",
            stringify!(allocate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reallocate) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GLFWallocator),
            "::",
            stringify!(reallocate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).deallocate) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GLFWallocator),
            "::",
            stringify!(deallocate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).user) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GLFWallocator),
            "::",
            stringify!(user)
        )
    );
}
extern "C" {
